export const BOT_MESSAGES = {
  NEW_USER_GREETING: ', вітаємо!',
  NEW_USER_PERMISSIONS:
    'Let bidding - це бот, за допомогою якого ви можете: тра-та-та',
  NEW_USER_MY_PROFILE: 'Пропонуємо розпочати із команди /some_command 😉',
  DATA_PROCESSING_AGREEMENT:
    'Продовжуючи, Ви даєте згоду на обробку Ваших персональних даних!',
  CANCEL_REGISTRATION:
    'Нажаль, Ви не можете продовжити, оскільки не надали згоду на обробку своїх персональних даних.',
  ENTER_FIRST_NAME: "Введіть ваше ім'я:",
  ENTER_LAST_NAME: 'Введіть ваше прізвище:',
  SKIP_SCENE_STEP_PARAGRAPH:
    "Ви можете пропустити даний крок натиснувши на кнопку 'Пропустити' 👇",
  SHARE_PHONE_PARAGRAPH:
    "Натисніть, будь-ласка, на кнопку 'Поділитися телефоном' 👇",
  SHARE_PHONE_PARAGRAPH_2:
    'Якщо вона прихована у Вашому месенджері, натисність на іконку 🎛 з кружечками нижче, зправа від поля вводу текстового повідомлення!',
  ERROR: {
    GENERAL: 'Нажаль, сталася помилка, спробуйте будь-ласка знову!',
    CHECK_BTN: 'Оберіть, будь-ласка, дію вище 👆',
    FIRST_NAME:
      "Введіть, будь-ласка, <u>лише ім'я!</u> \nІм'я не може бути менше ніж 2 літери, без сторонніх символів та пробілів",
    LAST_NAME:
      'Введіть, будь-ласка, <u>лише прізвище!</u> \nПрізвище не може бути менше ніж 2 букви, без сторонніх символів та пробілів',
    USER_PHONE: "Натисніть, будь-ласка, кнопку 👇 'Поділитися телефоном'",
    CREATE_USER:
      'Під створення профілю сталася помилка, спробуйте будь-ласка знову!',
  },
  BTN_TITLE: {
    OK: 'Так',
    CANCEL: 'Ні',
    SKIP: 'Пропустити',
    SHARE_PHONE_NUMBER: 'Поділитися телефоном',
  },
};
